In [1]:
%load_ext sql
%sql sqlite:///CourseDataWarehouse.db

'Connected: @CourseDataWarehouse.db'

## **Domain Integrity**

### _PROGRAMS WH_

In [2]:
%%sql
SELECT *
FROM PROGRAMS_WH
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'Asian Studies', 'AN'),
 (2, 'Business', 'BU'),
 (3, 'Black Studies', 'BL'),
 (4, 'Bioengineering', 'BEN'),
 (5, 'Arabic', 'AR')]

### _LOCATIONS WH_

In [3]:
%%sql
SELECT *
FROM LOCATIONS_WH
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'DSB 105'),
 (2, 'DSB 111'),
 (3, 'DSB 110A'),
 (4, 'DSB 108'),
 (5, 'DSB 110B')]

### _FACULTY WH_

In [4]:
%%sql
SELECT *
FROM FACULTY_WH
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos')]

### _CATALOGS WH_

In [5]:
%%sql
SELECT *
FROM CATALOGS_WH
LIMIT 3;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'AN 0301', '1-3 Credits', None, None, None, 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.', None),
 (2, 'AN 0310', '3 Credits', None, None, None, 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.', None),
 (3, 'BU 0211', '3 Credits', 'Junior standing.', None, None, 'This course examines the broad philosophical as well as practical nature and function of the legal system, and introduces students to the legal and s ... (171 characters truncated) ... ivil process, and regulatory areas such as employment discrimination, protection of the environment, and corporate governance and securities markets.', None)]

### _COURSES WH (FACT TABLE)_

In [6]:
%%sql
SELECT *
FROM COURSES_WH
LIMIT 5;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 34130, 'Spring2015', 'Independent Study', 'DL', 0, 1, 1, '[]', 1, 7, 570, 1),
 (2, 73018, 'Fall2017', 'Independent Study', 'JX', 1, 0, -1, '[]', 1, 16, 94, 1),
 (3, 34010, 'Spring2015', 'Asian Studies Seminar', 'B', 2, 5, 3, "['W 0630pm-0900pm 01/20-04/30 CNS 305']", 1, 20, 94, 2),
 (4, 34010, 'Spring2015', 'Asian Studies Seminar', 'B', 2, 5, 3, "['W 0630pm-0900pm 01/20-04/30 CNS 305']", 1, 17, 94, 2),
 (5, 71367, 'Fall2017', 'Asian Studies Seminar', '1', 1, 5, 4, '[]', 1, 67, 570, 2)]

# **Entity Integrity**

### _PROGRAMS WH_

In [7]:
%%sql
SELECT DISTINCT COUNT(program_code), COUNT(PID), COUNT(program_code)
FROM PROGRAMS_WH;

 * sqlite:///CourseDataWarehouse.db
Done.

[(83, 83, 83)]

### _LOCATIONS WH_

In [8]:
%%sql
SELECT DISTINCT COUNT(location), COUNT(LID), COUNT(location)
FROM LOCATIONS_WH;

 * sqlite:///CourseDataWarehouse.db
Done.

[(201, 201, 201)]

### _FACULTY WH_

In [9]:
%%sql
SELECT DISTINCT COUNT(FName), COUNT(FID), COUNT(FName)
FROM FACULTY_WH;

 * sqlite:///CourseDataWarehouse.db
Done.

[(1104, 1104, 1104)]

### _CATALOGS WH_

In [10]:
%%sql
SELECT DISTINCT COUNT(CourseCode), COUNT(CatID), COUNT(CourseCode)
FROM CATALOGS_WH;

 * sqlite:///CourseDataWarehouse.db
Done.

[(2220, 2220, 2220)]

### _COURSES WH (FACT TABLE)_

In [11]:
%%sql
SELECT DISTINCT COUNT(CRN), COUNT(CID), COUNT(CRN)
FROM COURSES_WH;

 * sqlite:///CourseDataWarehouse.db
Done.

[(17886, 17886, 17886)]

# **Relational Integrity**

In [13]:
%%sql

SELECT CourseCode, program_name, CRN, FName, location
FROM COURSES_WH
    JOIN PROGRAMS_WH USING (PID)
    JOIN CATALOGS_WH USING (CatID)
    JOIN FACULTY_WH USING (FID)
    JOIN LOCATIONS_WH USING (LID)
GROUP BY CRN
ORDER BY program_name
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[('AC 0555', 'Accounting', 10913, 'Dawn W  Massey', 'DSB 115'),
 ('AC 0555', 'Accounting', 11618, 'Dawn W  Massey', 'DSB 104'),
 ('AC 0204', 'Accounting', 31036, 'Milo W.  Peck', 'DSB 110A'),
 ('AC 0204', 'Accounting', 31072, 'Milo W.  Peck', 'DSB 110A'),
 ('AC 0345', 'Accounting', 31090, 'Kathi M.  Mettler', 'DSB 2109A'),
 ('AC 0012', 'Accounting', 31092, 'Rebecca I.  Bloch', 'DSB 108'),
 ('AC 0203', 'Accounting', 31148, 'Rebecca I.  Bloch', 'DSB 104'),
 ('AC 0310', 'Accounting', 31158, 'Lisa Suzanne  Haylon', 'DSB 106'),
 ('AC 0012', 'Accounting', 31177, 'Rebecca I.  Bloch', 'DSB 108'),
 ('AC 0012', 'Accounting', 31194, 'Bruce   Bradford', 'DSB 104')]

## Demo Queries

### What courses has Dr. Huntley taught the most?

In [14]:
%%sql
SELECT FID, FName,CourseCode, Title, COUNT(DISTINCT CRN) as NumTaught
FROM FACULTY_WH
    JOIN COURSES_WH USING (FID)
    JOIN CATALOGS_WH USING (CatID)
WHERE (FName like '%Huntley%')
GROUP BY title
ORDER BY NumTaught DESC
LIMIT 4;

 * sqlite:///CourseDataWarehouse.db
Done.

[(275, 'Christopher L.  Huntley', 'OM 0101', 'Operations Management', 7),
 (275, 'Christopher L.  Huntley', 'IS 0240', 'Systems Analysis and Logical Design', 4),
 (275, 'Christopher L.  Huntley', 'IS 0320', 'Systems Design and Implementation', 4),
 (275, 'Christopher L.  Huntley', 'IS 0135', 'Fundamentals of Web Design', 3)]

### What rooms in DSB has Dr. Huntley taught in?

In [16]:
%%sql
SELECT FName, Location
FROM FACULTY_WH
    JOIN COURSES_WH USING (FID)
    JOIN LOCATIONS_WH USING (LID)
WHERE (FName like '%Huntley%') and (location like '%DSB%')
GROUP BY location;

 * sqlite:///CourseDataWarehouse.db
Done.

[('Christopher L.  Huntley', 'DSB 104'),
 ('Christopher L.  Huntley', 'DSB 106'),
 ('Christopher L.  Huntley', 'DSB 107'),
 ('Christopher L.  Huntley', 'DSB 108'),
 ('Christopher L.  Huntley', 'DSB 109'),
 ('Christopher L.  Huntley', 'DSB 110A'),
 ('Christopher L.  Huntley', 'DSB 110B'),
 ('Christopher L.  Huntley', 'DSB 111'),
 ('Christopher L.  Huntley', 'DSB 112'),
 ('Christopher L.  Huntley', 'DSB 114'),
 ('Christopher L.  Huntley', 'DSB 115'),
 ('Christopher L.  Huntley', 'DSB 2109A')]

## Which professors have taught an Accounting Class?

In [25]:
%%sql
SELECT program_code, program_name, FName
FROM COURSES_WH
    JOIN PROGRAMS_WH USING (PID)
    JOIN FACULTY_WH USING (FID)
WHERE program_name like '%Accounting%'
GROUP BY FName;

 * sqlite:///CourseDataWarehouse.db
Done.

[('AC', 'Accounting', 'Ahmed M.  Ebrahim'),
 ('AC', 'Accounting', 'Arleen N.  Kardos'),
 ('AC', 'Accounting', 'Bruce   Bradford'),
 ('AC', 'Accounting', 'Carlos   Fernandez-Varela'),
 ('AC', 'Accounting', 'Charles   Gill'),
 ('AC', 'Accounting', 'David J.  Orticelli'),
 ('AC', 'Accounting', 'David L.  Glinka'),
 ('AC', 'Accounting', 'Dawn W  Massey'),
 ('AC', 'Accounting', 'Gregory Patrick  Burke'),
 ('AC', 'Accounting', 'Jenna Marie  Allegretto'),
 ('AC', 'Accounting', 'Jo Ann   Drusbosky'),
 ('AC', 'Accounting', 'Joan L.  Lee'),
 ('AC', 'Accounting', 'John L.  DeMelis'),
 ('AC', 'Accounting', "Joseph R.  D'Agostin"),
 ('AC', 'Accounting', 'Kara E.  Hunter'),
 ('AC', 'Accounting', 'Kathi M.  Mettler'),
 ('AC', 'Accounting', 'Kevin C.  Cassidy'),
 ('AC', 'Accounting', 'Kristen   Tharrington'),
 ('AC', 'Accounting', 'Lisa Suzanne  Haylon'),
 ('AC', 'Accounting', 'Michael P.  Coyne'),
 ('AC', 'Accounting', 'Michael P.  Spiro'),
 ('AC', 'Accounting', 'Milo W.  Peck'),
 ('AC', 'Accounting', 'Patricia M.  Poli'),
 ('AC', 'Accounting', 'Paul   Caster'),
 ('AC', 'Accounting', 'Rebecca I.  Bloch'),
 ('AC', 'Accounting', 'Richard   Hunter'),
 ('AC', 'Accounting', 'Rob   Hornak'),
 ('AC', 'Accounting', 'Sarah Jennie  Bollinger'),
 ('AC', 'Accounting', 'Scott M  Brenner'),
 ('AC', 'Accounting', 'Scott R.  Colvin'),
 ('AC', 'Accounting', 'Stephanie   Miller'),
 ('AC', 'Accounting', 'Stephen E.  Yost'),
 ('AC', 'Accounting', 'Tara M.  Berwick'),
 ('AC', 'Accounting', 'Victor E.  Hartman')]